posts/2015-10-11-prayer-for-a-unified-church.org
#+date: <2015-10-11>
#+filetags: prayer religion
#+title: Prayer for a Unified Church

Holy God,

Forgive us for those times\\

When individuality was more\\
important to us than community...

When being right was more\\
important to us than being loving...

When our own agendas were more\\
important to us than your Kingdom...

When our own labels were more\\
important to us than the name of Christ.

Give us now a new vision\\
of that which binds us together,

The same baptism,\\
in response to the same call,\\
to fulfill the same mission,\\
in service to the same Lord.

For then, we sill see in others,\\
not differences to be feared,\\
but diversity to be embraced,

Modeling before the world,\\
the beauty of the Triune God,\\

Father, Son, and Spirit,\\

Three persons,\\
but one God,\\

Forever and ever,

/Amen/





#+begin_tagline
Tagged: [[file:../tags/prayer.org][Prayer]] [[file:../tags/religion.org][Religion]]
#+end_tagline
