docs/posts/2015-10-11-prayer-for-a-unified-church.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 29, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Prayer for a Unified Church</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Prayer for a Unified Church</h1>
<p class="subtitle" role="doc-subtitle">Oct 11, 2015</p>
</header><p>
Holy God,
</p>

<p>
Forgive us for those times<br>
</p>

<p>
When individuality was more<br>
important to us than community&#x2026;
</p>

<p>
When being right was more<br>
important to us than being loving&#x2026;
</p>

<p>
When our own agendas were more<br>
important to us than your Kingdom&#x2026;
</p>

<p>
When our own labels were more<br>
important to us than the name of Christ.
</p>

<p>
Give us now a new vision<br>
of that which binds us together,
</p>

<p>
The same baptism,<br>
in response to the same call,<br>
to fulfill the same mission,<br>
in service to the same Lord.
</p>

<p>
For then, we sill see in others,<br>
not differences to be feared,<br>
but diversity to be embraced,
</p>

<p>
Modeling before the world,<br>
the beauty of the Triune God,<br>
</p>

<p>
Father, Son, and Spirit,<br>
</p>

<p>
Three persons,<br>
but one God,<br>
</p>

<p>
Forever and ever,
</p>

<p>
<i>Amen</i>
</p>





<div class="tagline" id="orgfc781f9">
<p>
Tagged: <a href="../tags/prayer.html">Prayer</a> <a href="../tags/religion.html">Religion</a>
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 29, 2024.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
